; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 980971 2 2 2 7 3
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	thermograph1 - mode
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation4 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon8)
)
(:goal (and
	(have_image Planet7 infrared0)
	(have_image Phenomenon8 infrared0)
	(have_image Star9 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 3
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 3
3. (turn_to satellite0 star9 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star9)
   goals met: 0 of 3
4. (turn_to satellite1 groundstation4 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 groundstation4)
   goals met: 0 of 3
5. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 0 of 3
6. (turn_to satellite0 planet7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet7)
   goals met: 0 of 3
7. (turn_to satellite1 star9 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star9)
   goals met: 0 of 3
8. (turn_to satellite0 phenomenon8 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon8)
   goals met: 0 of 3
9. (take_image satellite1 star9 instrument1 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 1 of 3
10. (turn_to satellite0 groundstation0 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation0)
   goals met: 1 of 3
11. (turn_to satellite1 planet7 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet7)
   goals met: 1 of 3
12. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 1 of 3
13. (take_image satellite1 planet7 instrument1 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 2 of 3
14. (turn_to satellite0 phenomenon8 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 3
15. (take_image satellite0 phenomenon8 instrument0 infrared0)
   added: (have_image phenomenon8 infrared0)
   goals met: 3 of 3
